Repository: ArduPilot/ardupilot
Catalog: Tools/ArdupilotMegaPlanner/GCSViews/FlightData.*.resx
Languages: it_it, pl

# stopRecordToolStripMenuItem.Text
source: Stop Record
it_it: Ferma Registrazione
pl: Zatrzymaj rejestrację

# NUM_playbackspeed.ToolTip
source: Playback Speed
it_it: Velocità di riproduzione
pl: Prędkość odtwarzania

# BUT_setmode.Text
source: Set Mode
it_it: Inposta Modo
pl: Ustaw tryb

# tabTLogs.Text
source: Telemetry Logs
it_it: Logs Telemetria
pl: Logi telemetrii

# BUT_setwp.Text
source: Set WP
it_it: Imposta WP
pl: Ustaw punkt drogi

# recordHudToAVIToolStripMenuItem.Text
source: Record Hud to AVI
it_it: Registra Hud in AVI
pl: Zapisz HUD w pliku AVI

# BUT_Homealt.ToolTip
source: Set the current display alt as 0, ie home alt is shown as 0
it_it: Imposta l'altezza visualizzata a 0, Es.: L'altezza della home è 0
pl: Ustaw aktualną wysokosć na 0, np. wysokość startu jest 0

# BUT_joystick.ToolTip
source: Setup and enable your joystick
it_it: Configura e attiva Joystick
pl: Skonfiguruj i włącz joystick

# BUT_loadtelem.Text
source: Load Log
it_it: Carica Log
pl: Załaduj Log

# lbl_winddir.Text
source: Dir: 0
pl: Kierunek: 0

# BUT_Homealt.Text
source: Set Home Alt
it_it: Setta l'Altezza della Home
pl: Ustaw wysokość startu

# BUTactiondo.ToolTip
source: Preform the action ot the left
it_it: Avvia l'azione sulla Sinistra
pl: Wykonaj akcję po lewej

# tabActions.Text
source: Actions
it_it: Azioni
pl: Akcje

# Gspeed.ToolTip
source: Double click me to change Max
it_it: Doppio Click per cambiare il Massimo
pl: Podwójne kliknięcie zmienia Max

# BUT_RAWSensor.ToolTip
source: View raw Gyro and Accel values, and Raw Radio ins/outs
it_it: Visualizza i valori grezzi dei Giroscopi e degli Accellerometri, e gli Ingressi/Uscite della radio
pl: Zobacz surowe dane Żyro, Przyspieszeniomierzy oraz wej/wyj Radia

# BUT_quickmanual.ToolTip
source: Change Mode to Manual/Stabalize
it_it: Cambia Modo in Manuale/Stabilizzato
pl: Zmień tryb na Ręczny/Stabilizacja

# BUTrestartmission.Text
source: Restart Mission
it_it: Riavvia Missione
pl: Restart misji

# BUTactiondo.Text
source: Do Action
it_it: Fai un Azione
pl: Wykonaj akcję

# dataGridViewImageColumn2.HeaderText
source: Down
it_it: Giù
pl: Dół

# CB_tuning.Text
source: Tuning
it_it: Settaggi
pl: Strojenie

# lbl_winddir.ToolTip
source: Estimated Wind Direction
it_it: Direzione stimata del vento
pl: Estymowany kierunek wiatru

# CHK_autopan.Text
source: Auto Pan
it_it: Auto Panoramica
pl: Automatyczne przesuwanie

# tabGauges.Text
source: Gauges
it_it: Strumenti
pl: Wskaźniki

# BUT_quickrtl.ToolTip
source: Change Mode to RTL
it_it: Cambia Modo in RTL
pl: Zmień tryb na RTL

# BUT_script.Text
source: Script
it_it: Programma
pl: Skrypt

# CHK_autopan.ToolTip
source: Makes the map autopan based on current location
it_it: Modifica la Panoramica sulla mappa basandoti sulla posizione corrente
pl: Powoduje automatyczne przesuwanie mapy do aktulanej pozycji

# dataGridViewImageColumn1.HeaderText
source: Up
it_it: Su
pl: Góra

# BUT_clear_track.Text
source: Clear Track
it_it: Pulisci Traccia
pl: Wyczyść trasę

# label1.Text
source: Zoom
pl: Powiększenie

# BUT_log2kml.Text
source: Tlog > Kml or Graph
it_it: Log > KML
pl: Log > KML

# CB_tuning.ToolTip
source: Show the tunning graph, chowing target attitudes vs actual
it_it: Visualizza il grafico di tuning, Evidenziando l'assetto desiderato contro quello attuale
pl: Pokaż wykres strojenia: docelowe oraz zadane położenia

# lbl_windvel.Text
source: Vel: 0
pl: Pr: 0

# Zoomlevel.ToolTip
source: Change Zoom Level
it_it: Cambia Livello di Zoom
pl: Zmień stopień powiększenia

# BUT_clear_track.ToolTip
source: Clear the recorded path on the map
it_it: Pulisci il percorso registrato sulla Mappa
pl: Wyczyść zapisaną ścieżkę na mapie

# BUTrestartmission.ToolTip
source: Restarts the mission from the beginning
it_it: Ricomincia la Missione dall'Inizio
pl: Restartuje misję od początku

# BUT_RAWSensor.Text
source: Raw Sensor View
it_it: Vista grezza del Sensore
pl: Widok surowych danych czujników

# lbl_windvel.ToolTip
source: Estimated Wind Velocity
it_it: Velocità stimata del vento
pl: Estymowana prędkość wiatru

# goHereToolStripMenuItem.Text
source: Fly To Here
it_it: Vola qui
pl: Leć tutaj

# BUT_quickauto.ToolTip
source: Change mode to Auto
it_it: Cambia il modo in Auto
pl: Zmień tryb na Auto

# BUT_setwp.ToolTip
source: Changes the current target waypoint
it_it: Cambia il corrente punto di destinazione
pl: Zmienia aktualny docelowy punkt zwrotny

# BUT_playlog.Text
source: Play/Pause
it_it: Avvia/Pausa
pl: Odtwarzanie/Pauza

# BUT_quickmanual.Text
source: &Manual
it_it: &Manuale
pl: Rę&cznie

# BUT_setmode.ToolTip
source: Changes to the Mode on the left
it_it: Cambia nel Modo sulla sinistra
pl: Zmienia na tryb po lewej

# pointCameraHereToolStripMenuItem.Text
source: Point Camera Here
it_it: Punta qui la Telecamera
pl: Skieruj kamerę tutaj

# tabStatus.Text
source: Status
it_it: Stato
