Repository: ArduPilot/ardupilot
Catalog: Tools/ArdupilotMegaPlanner/GCSViews/FlightPlanner.*.resx
Languages: pl, zh_tw

# Down.HeaderText
source: Down
pl: Dół
zh_tw: 下移

# CHK_geheight.Text
source: Verify Height
pl: Weryfikuj wysokość
zh_tw: 驗證高度

# ContextMeasure.Text
source: Measure Distance
pl: Zmierz odległość
zh_tw: 測距

# Command.ToolTipText
source: APM Command
pl: Polecenie APM
zh_tw: APM 命令

# clearMissionToolStripMenuItem.Text
source: Clear Mission
pl: Wyczyść misję
zh_tw: 清空任務

# CHK_holdalt.Text
source: Hold default Alt
pl: Utrzymuj domyślną wysokość
zh_tw: 保持默認高度

# loadFromFileToolStripMenuItem.Text
source: Load from File
pl: Załaduj z pliku

# panelWaypoints.Text
source: Waypoints
pl: Punkty zwrotne

# deleteWPToolStripMenuItem.Text
source: Delete WP
pl: Usuń PZ
zh_tw: 删除航點

# LBL_defalutalt.Text
source: Default Alt
pl: Domyślna wysokość
zh_tw: 默認高度

# loitercirclesToolStripMenuItem.Text
source: Circles
pl: Okręgi
zh_tw: 圈數

# Delete.HeaderText
source: Delete
pl: Usuń
zh_tw: 删除

# Up.HeaderText
source: Up
pl: Góra
zh_tw: 上移

# Up.ToolTipText
source: Move the row UP
pl: Przesuń wiersz w GÓRĘ
zh_tw: 向上移动本行

# saveToFileToolStripMenuItem.Text
source: Save to File
pl: Zapis do pliku

# jumpToolStripMenuItem.Text
source: Jump
pl: Skok
zh_tw: 跳轉

# polygonToolStripMenuItem.Text
source: Draw Polygon
pl: Rysuj wielokąt

# dataGridViewImageColumn2.HeaderText
source: Down
pl: Dół

# BUT_write.Text
source: Write WPs
pl: Zapisz punkty zwrotne
zh_tw: 寫入航路

# Down.ToolTipText
source: Move the row down
pl: Przesuń wiersz w DÓŁ
zh_tw: 向下移動本行

# lbl_distance.Text
source: Distance
pl: Odległość
zh_tw: 總計航程

# jumpwPToolStripMenuItem.Text
source: WP #
pl: PD #

# GeoFenceuploadToolStripMenuItem.Text
source: Upload
pl: Wyślij

# addPolygonPointToolStripMenuItem.Text
source: Add Polygon Point
pl: Dodaj punkt wielokątu
zh_tw: 增加頂點

# Delete.ToolTipText
source: Delete the row
pl: Usuń wiersz
zh_tw: 删除行

# panelAction.Text
source: Action
pl: Akcja

# clearPolygonToolStripMenuItem.Text
source: Clear Polygon
pl: Wyczyść wielokąt
zh_tw: 清除區域

# setReturnLocationToolStripMenuItem.Text
source: Set Return Location
pl: Ustaw miejsce powrotu

# Command.HeaderText
source: Command
pl: Polecenie
zh_tw: 命令

# LBL_WPRad.Text
source: WP Radius
pl: Promień punktu zwrotnego
zh_tw: 航點半徑

# label8.Text
source: Alt
pl: Wys
zh_tw: 高度

# BUT_read.Text
source: Read WPs
pl: Odczytaj punkty zwrotne
zh_tw: 讀取航路

# label5.Text
source: Loiter Radius
pl: Promień krążenia
zh_tw: 盤旋半徑

# label4.Text
source: Home Location
pl: Położenie startu
zh_tw: 起始位置

# dataGridViewImageColumn1.HeaderText
source: Up
pl: Góra

# label7.Text
source: Mouse Location
pl: Położenie kursora
zh_tw: 滑鼠位置

# comboBoxMapType.ToolTip
source: Change the current map type
pl: Zmień typ mapy
zh_tw: 更改當前地圖類型

# loiterForeverToolStripMenuItem.Text
source: Forever
pl: Na zawsze
zh_tw: 永久

# label3.Text
source: Alt (abs)
pl: Wys (bezwzgl)
zh_tw: 高度

# rotateMapToolStripMenuItem.Text
source: Rotate Map
pl: Obróć mapę
zh_tw: 旋轉地圖

# GeoFencedownloadToolStripMenuItem.Text
source: Download
pl: Pobierz

# lbl_homedist.Text
source: Home
pl: Punkt startu
zh_tw: 距起始點

# CHK_altmode.Text
source: Absolute Alt
pl: Wys. bezwzględna
zh_tw: 絕對高度

# lbl_prevdist.Text
source: Prev
pl: Poprz
zh_tw: 距上一點

# label11.Text
source: Zoom
pl: Powiększenie
zh_tw: 縮放

# loitertimeToolStripMenuItem.Text
source: Time
pl: Czas
zh_tw: 時間

# loiterToolStripMenuItem.Text
source: Loiter
pl: Krążenie
zh_tw: 盤旋

# BUT_Add.Text
source: Add Below
pl: Dodaj poniżej
zh_tw: 添加

# Alt.HeaderText
source: Alt
pl: Wys
zh_tw: 高度

# BUT_Add.ToolTip
source: Add a line to the grid bellow
pl: Dodaj linię do siatki poniżej
zh_tw: 在下方表格中增加一行

# Param1.HeaderText
source: P1
zh_tw: 參數1

# Param2.HeaderText
source: P2
zh_tw: 參數2

# Param3.HeaderText
source: P3
zh_tw: 參數3

# Param4.HeaderText
source: P4
zh_tw: 參數4

# Lat.HeaderText
source: Lat
zh_tw: 緯度

# Lon.HeaderText
source: Lon
zh_tw: 經度

# label2.Text
source: Long
zh_tw: 經度

# Label1.Text
source: Lat
zh_tw: 緯度

# label9.Text
source: Long
zh_tw: 經度

# label10.Text
source: Lat
zh_tw: 緯度

# lbl_status.Text
source: Status
zh_tw: 狀態
