Repository: ArduPilot/ardupilot
Catalog: Tools/ArdupilotMegaPlanner/GCSViews/Simulation.*.resx
Languages: es_es, it_it, ru_ru, zh_tw

# label12.Text
source: Roll
es_es: Alabeo
it_it: Rollio
ru_ru: Крен
zh_tw: 横滾

# label10.Text
source: Altitude ERR
es_es: Error Altitud
it_it: ERR Altezza
ru_ru: Ошибка выс.
zh_tw: 高度偏移

# CHKREV_roll.Text
source: Reverse Roll
es_es: Invertir Alabeo
it_it: Inverti Roll
ru_ru: Реверс Крен
zh_tw: 横滾舵反向

# label13.Text
source: Pitch
es_es: Cabeceo
it_it: Passo
ru_ru: Тангаж
zh_tw: 俯仰

# label16.Text
source: Ardupilot Output
es_es: Salida Ardupilot
it_it: Uscita Ardupilot
ru_ru: Автопилот
zh_tw: Ardupilot 輸出

# label11.Text
source: Plane IMU
it_it: IMU Aereo
ru_ru: IMU Самолета
zh_tw: 飛机 IMU

# label14.Text
source: Yaw
es_es: Guiñada
it_it: Timone
ru_ru: Рысканье
zh_tw: 偏航

# RAD_JSBSim.ToolTip
source: Can do Plane/Heli/Quads
es_es: Puede hacer Plane/Heli/Quads
it_it: Può fare Aereo/Eli/Quads

# label17.Text
source: GPS Refresh Rate
es_es: Frecuencia Actualización GPS
it_it: Rateo di Aggiornamento GPS
zh_tw: GPS 刷新率

# label15.Text
source: Throttle
es_es: Acelerador
it_it: Motore
ru_ru: Газ
zh_tw: 油門

# label18.Text
source: Autopilot Status
es_es: Estado Piloto Automatico
it_it: Stato Autopilot
zh_tw: 自駕儀狀態

# CHKgraphroll.Text
source: Show Roll
es_es: Mostrar Alabeo
it_it: Mostra Rollio

# label20.Text
source: Mode
es_es: Modo
it_it: Modo
ru_ru: Режим
zh_tw: 模式

# label21.Text
source: Simulator Authority - For diff planes
es_es: Simulador de Autoridad - Para aviones diff
it_it: Autorità del simulatore - Per gli aerei Diff
zh_tw: 模擬器權值-用於不同飛行器

# BUT_startfgquad.Text
source: Start FG Quad
es_es: Iniciar FG Quad
it_it: Avvia Quad FG
zh_tw: 啟動 FG 四軸

# label22.Text
source: Roll Gain
es_es: Banancia Alabeo
it_it: Guadagno Rollio
zh_tw: 横滾增益

# label23.Text
source: Pitch Gain
es_es: Ganancia Cabeceo
it_it: Guadagno Passo
zh_tw: 俯仰增益

# label24.Text
source: Rudder Gain
es_es: Ganancia Timón
it_it: Guadagno Timone
zh_tw: 方向增益

# label2.Text
source: Longitude
es_es: Longitud
it_it: Longitudione
ru_ru: Долгота
zh_tw: 經度

# label25.Text
source: Throttle Gain
es_es: Ganancia Acelerador
it_it: Guadagno Motore
zh_tw: 油門增益

# label3.Text
source: Altitude
es_es: Altitud
it_it: Altezza
ru_ru: Высота
zh_tw: 高度

# label26.Text
source: These
es_es: Estos
it_it: Questi
zh_tw: 僅 在

# label27.Text
source: are
es_es: son
it_it: Sono
zh_tw: 模擬器

# label1.Text
source: Latitude
es_es: Latitud
it_it: Latitudine
ru_ru: Широта
zh_tw: 緯度

# label28.Text
source: SIM only
es_es: Solo SIM
it_it: Solo SIM
zh_tw: 中使用

# but_advsettings.Text
source: Advanced IP Settings
es_es: Ajustes IP Avanzados
it_it: Settaggio IP avanzato
zh_tw: 高級設置

# label6.Text
source: Pitch
es_es: Cabeceo
it_it: Passo
ru_ru: Тангаж
zh_tw: 俯仰

# label29.Text
source: NOTE:
es_es: Nota:
it_it: NOTA:

# label7.Text
source: Heading
es_es: Título
it_it: Puntamento
ru_ru: Направление
zh_tw: 朝向

# label4.Text
source: Plane GPS
es_es: Plano GPS
it_it: GPS Aereo
ru_ru: GPS Самолета
zh_tw: 飛机 GPS

# label5.Text
source: Roll
es_es: Alabeo
it_it: Rollio
ru_ru: Крен
zh_tw: 横滾

# ConnectComPort.Text
source: Sim Link Start/Stop
es_es: Enlace Sim Inicio/Paro
it_it: Link SIM Avvia/Ferma
ru_ru: Старт/Стоп
zh_tw: 模擬鏈接啟動/停止

# label9.Text
source: Bearing ERR
es_es: Teniendo ERR
it_it: ERR Attinenza
ru_ru: Ошибка курс
zh_tw: 方位偏移

# CHKdisplayall.Text
source: Display All
es_es: Mostrar Todo
it_it: Mostra Tutto
zh_tw: 顯示所有

# chkSensor.Text
source: Sensor
it_it: Sensore
zh_tw: 感應器

# SaveSettings.Text
source: Save Settings
es_es: Guardar Ajustes
it_it: Salva Settaggi
ru_ru: Сохранить
zh_tw: 保存設置

# BUT_startfgplane.Text
source: Start FG Plane
es_es: Inicio Plano FG
it_it: Avvia Aereo FG
zh_tw: 啟動 FG 固定翼

# CHKgraphrudder.Text
source: Show Rudder
es_es: Mostrar Timón
it_it: Mostra Timone

# label30.Text
source: Yaw
es_es: Guiñada
it_it: Imbardata
ru_ru: Рыск.
zh_tw: 偏航

# CHKREV_rudder.Text
source: Reverse Rudder
es_es: Invertir Timón
it_it: Inverti Timone
ru_ru: Реверс Рысканье
zh_tw: 方向舵反向

# RAD_softFlightGear.ToolTip
source: Can do Plane and Quad with model
es_es: Puede hacer con el modelo Avión y Quad
it_it: Puà fare Aereo e Quad con il modello

# CHKREV_pitch.Text
source: Reverse Pitch
es_es: Intertir Cabeceo
it_it: Inverti Passo
ru_ru: Реверс Тангаж
zh_tw: 俯仰舵反向

# CHKgraphthrottle.Text
source: Show Throttle
es_es: Mostrar Acelerador
it_it: Mostra Motore

# CHKgraphpitch.Text
source: Show Pitch
es_es: Mostrar Cabeceo
it_it: Mostra Passo

# RAD_aerosimrc.ToolTip
source: Can do Plane/Heli/Quads
es_es: Puede hacer de avión / Heli o Quads
it_it: Può fare Aereo/Eli/Quad

# BUT_startxplane.Text
source: Start Xplane
es_es: Iniciat Xplane
it_it: Avvia Xplane
zh_tw: 啟動 Xplane

# RAD_softXplanes.ToolTip
source: Can Do Plane/Quad with plugin
es_es: Puede hacer Plano / Quad con el plugin
it_it: Può fare Aereo/Quad con Plugin

# label8.Text
source: WPDist
ru_ru: Расстояние
zh_tw: 航點距離

# label19.Text
source: WP
zh_tw: 航點

# CHK_quad.Text
source: Quad
zh_tw: 四 軸

# CHK_heli.Text
source: Heli
zh_tw: 直升機
